In [1]:
import sqlhelpers as sh

In [2]:
# %load Exercise Files\\Chapters\\sql-chap03.txt

# Creating a table

In [7]:
# create a table within a database
q = '''
CREATE TABLE test (
  a INTEGER,
  b TEXT
);
'''

sh.perform_insert_and_stats(q, 'chapter03.db')

### Query Summary ###

DATABASE QUERIED: chapter03.db
QUERY: |||
CREATE TABLE test (
  a INTEGER,
  b TEXT
);
 |||

In [8]:
# add some data to the new table
q1 = "INSERT INTO test VALUES ( 1, 'a' );"
q2 = "INSERT INTO test VALUES ( 2, 'b' );"
q3 = "INSERT INTO test VALUES ( 3, 'c' );"

sh.perform_insert_and_stats(q1, 'chapter03.db')
sh.perform_insert_and_stats(q2, 'chapter03.db')
sh.perform_insert_and_stats(q3, 'chapter03.db')

### Query Summary ###

DATABASE QUERIED: chapter03.db
QUERY: ||| INSERT INTO test VALUES ( 1, 'a' ); |||
### Query Summary ###

DATABASE QUERIED: chapter03.db
QUERY: ||| INSERT INTO test VALUES ( 2, 'b' ); |||
### Query Summary ###

DATABASE QUERIED: chapter03.db
QUERY: ||| INSERT INTO test VALUES ( 3, 'c' ); |||

In [9]:
# have a look at what we have just done.
q = "SELECT * FROM test;"
sh.query_result_stats(q, "chapter03.db")

### Query Summary ###

DATABASE QUERIED: chapter03.db
QUERY: ||| SELECT * FROM test; |||

There are 3 rows in the query results table
There are 2 columns in the query results table

First 5 rows of the query results:
   a  b
0  1  a
1  2  b
2  3  c

# Deleting a table

In [13]:
# create a table and put some data in
q1 = "CREATE TABLE test ( a TEXT, b TEXT );"
q2 = "INSERT INTO test VALUES ( 'one', 'two' );"

sh.perform_insert_and_stats(q1, 'chapter03.db')
sh.perform_insert_and_stats(q2, 'chapter03.db')

### Query Summary ###

DATABASE QUERIED: chapter03.db
QUERY: ||| CREATE TABLE test ( a TEXT, b TEXT ); |||
### Query Summary ###

DATABASE QUERIED: chapter03.db
QUERY: ||| INSERT INTO test VALUES ( 'one', 'two' ); |||

In [14]:
# have a look at what we have just done.
q = "SELECT * FROM test;"
sh.query_result_stats(q, "chapter03.db")

### Query Summary ###

DATABASE QUERIED: chapter03.db
QUERY: ||| SELECT * FROM test; |||

There are 1 rows in the query results table
There are 2 columns in the query results table

First 5 rows of the query results:
     a    b
0  one  two

In [15]:
q = "DROP TABLE test;"
sh.perform_insert_and_stats(q, 'chapter03.db')

### Query Summary ###

DATABASE QUERIED: chapter03.db
QUERY: ||| DROP TABLE test; |||

In [16]:
q = "DROP TABLE IF EXISTS test;"
sh.perform_insert_and_stats(q, 'chapter03.db')

### Query Summary ###

DATABASE QUERIED: chapter03.db
QUERY: ||| DROP TABLE IF EXISTS test; |||

# Inserting Rows

In [17]:
# create a table for us to use
q = "CREATE TABLE test ( a INTEGER, b TEXT, c TEXT );"
sh.perform_insert_and_stats(q, 'test.db')

### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| CREATE TABLE test ( a INTEGER, b TEXT, c TEXT ); |||

In [18]:
q = "SELECT * FROM test;"
sh.query_result_stats(q, "test.db")

### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| SELECT * FROM test; |||

There are 0 rows in the query results table
There are 3 columns in the query results table

First 5 rows of the query results:
Empty DataFrame
Columns: [a, b, c]
Index: []

In [19]:
# add some data to the table
q1 = "INSERT INTO test VALUES ( 1, 'This', 'Right here!' );" 
q2 = "INSERT INTO test ( b, c ) VALUES ( 'That', 'Over there!' );"

sh.perform_insert_and_stats(q1, 'test.db')
sh.perform_insert_and_stats(q2, 'test.db')

### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| INSERT INTO test VALUES ( 1, 'This', 'Right here!' ); |||
### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| INSERT INTO test ( b, c ) VALUES ( 'That', 'Over there!' ); |||

In [20]:
# inspect the added data
q = "SELECT * FROM test;"
sh.query_result_stats(q, "test.db")

### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| SELECT * FROM test; |||

There are 2 rows in the query results table
There are 3 columns in the query results table

First 5 rows of the query results:
     a     b            c
0  1.0  This  Right here!
1  NaN  That  Over there!

In [21]:
# add an empty row
q = "INSERT INTO test DEFAULT VALUES;"
sh.perform_insert_and_stats(q, 'test.db')

### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| INSERT INTO test DEFAULT VALUES; |||

In [22]:
# inspect the added data
q = "SELECT * FROM test;"
sh.query_result_stats(q, "test.db")

### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| SELECT * FROM test; |||

There are 3 rows in the query results table
There are 3 columns in the query results table

First 5 rows of the query results:
     a     b            c
0  1.0  This  Right here!
1  NaN  That  Over there!
2  NaN  None         None

In [23]:
# add rows from a select statement into this table
q = "INSERT INTO test ( a, b, c ) SELECT id, name, description from item;"
sh.perform_insert_and_stats(q, 'test.db')

### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| INSERT INTO test ( a, b, c ) SELECT id, name, description from item; |||

In [24]:
# inspect the added data
q = "SELECT * FROM test;"
sh.query_result_stats(q, "test.db")

### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| SELECT * FROM test; |||

There are 7 rows in the query results table
There are 3 columns in the query results table

First 5 rows of the query results:
     a                 b                                       c
0  1.0              This                             Right here!
1  NaN              That                             Over there!
2  NaN              None                                    None
3  1.0  Box of 64 Pixels       64 RGB pixels in a decorative box
4  2.0    Sense of Humor  Especially dry. Imported from England.

# Deleting Rows

In [25]:
# inspect the data
q = "SELECT * FROM test;"
sh.query_result_stats(q, "test.db")

### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| SELECT * FROM test; |||

There are 7 rows in the query results table
There are 3 columns in the query results table

First 5 rows of the query results:
     a                 b                                       c
0  1.0              This                             Right here!
1  NaN              That                             Over there!
2  NaN              None                                    None
3  1.0  Box of 64 Pixels       64 RGB pixels in a decorative box
4  2.0    Sense of Humor  Especially dry. Imported from England.

In [26]:
# audition the where clause to be sure of what is to be deleted
q = "SELECT * FROM test WHERE a = 1;"
sh.query_result_stats(q, "test.db")

### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| SELECT * FROM test WHERE a = 1; |||

There are 2 rows in the query results table
There are 3 columns in the query results table

First 5 rows of the query results:
   a                 b                                  c
0  1              This                        Right here!
1  1  Box of 64 Pixels  64 RGB pixels in a decorative box

In [27]:
q = "DELETE FROM test WHERE a = 1;"
sh.perform_insert_and_stats(q, 'test.db')

### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| DELETE FROM test WHERE a = 1; |||

In [28]:
# inspect the data
q = "SELECT * FROM test;"
sh.query_result_stats(q, "test.db")

### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| SELECT * FROM test; |||

There are 5 rows in the query results table
There are 3 columns in the query results table

First 5 rows of the query results:
     a               b                                            c
0  NaN            That                                  Over there!
1  NaN            None                                         None
2  2.0  Sense of Humor       Especially dry. Imported from England.
3  3.0          Beauty  Inner beauty. No cosmetic surgery required!
4  4.0        Bar Code               Unused. In original packaging.

# The NULL value

In [29]:
# inspect the data
q = "SELECT * FROM test;"
sh.query_result_stats(q, "test.db")

### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| SELECT * FROM test; |||

There are 5 rows in the query results table
There are 3 columns in the query results table

First 5 rows of the query results:
     a               b                                            c
0  NaN            That                                  Over there!
1  NaN            None                                         None
2  2.0  Sense of Humor       Especially dry. Imported from England.
3  3.0          Beauty  Inner beauty. No cosmetic surgery required!
4  4.0        Bar Code               Unused. In original packaging.

In [30]:
# this will fail to find null rows
q = "SELECT * FROM test WHERE a = NULL;"
sh.query_result_stats(q, "test.db")

### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| SELECT * FROM test WHERE a = NULL; |||

There are 0 rows in the query results table
There are 3 columns in the query results table

First 5 rows of the query results:
Empty DataFrame
Columns: [a, b, c]
Index: []

In [31]:
# the correct way to search for null values
q = "SELECT * FROM test WHERE a IS NULL;"
sh.query_result_stats(q, "test.db")

### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| SELECT * FROM test WHERE a IS NULL; |||

There are 2 rows in the query results table
There are 3 columns in the query results table

First 5 rows of the query results:
      a     b            c
0  None  That  Over there!
1  None  None         None

In [32]:
# test to see if there are actually values ie not null
q = "SELECT * FROM test WHERE a IS NOT NULL;"
sh.query_result_stats(q, "test.db")

### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| SELECT * FROM test WHERE a IS NOT NULL; |||

There are 3 rows in the query results table
There are 3 columns in the query results table

First 5 rows of the query results:
   a               b                                            c
0  2  Sense of Humor       Especially dry. Imported from England.
1  3          Beauty  Inner beauty. No cosmetic surgery required!
2  4        Bar Code               Unused. In original packaging.

In [33]:
# insert some data to interrogate the differences between NULL and the empty string
q = "INSERT INTO test ( a, b, c ) VALUES ( 0, NULL, '' );"
sh.perform_insert_and_stats(q, 'test.db')

### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| INSERT INTO test ( a, b, c ) VALUES ( 0, NULL, '' ); |||

In [34]:
# 
q = "SELECT * FROM test WHERE b IS NULL;"
sh.query_result_stats(q, "test.db")

### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| SELECT * FROM test WHERE b IS NULL; |||

There are 2 rows in the query results table
There are 3 columns in the query results table

First 5 rows of the query results:
     a     b     c
0  NaN  None  None
1  0.0  None

In [35]:
# are there empty strings in the b column?
q = "SELECT * FROM test WHERE b = '';"
sh.query_result_stats(q, "test.db")

### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| SELECT * FROM test WHERE b = ''; |||

There are 0 rows in the query results table
There are 3 columns in the query results table

First 5 rows of the query results:
Empty DataFrame
Columns: [a, b, c]
Index: []

In [36]:
# Empty strings are not returned when searching for NULL values
q = "SELECT * FROM test WHERE c IS NULL;"
sh.query_result_stats(q, "test.db")

### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| SELECT * FROM test WHERE c IS NULL; |||

There are 1 rows in the query results table
There are 3 columns in the query results table

First 5 rows of the query results:
      a     b     c
0  None  None  None

In [37]:
# create the test table again

q1 = "DROP TABLE test;"

q2 = '''
CREATE TABLE test (
  a INTEGER NOT NULL,
  b TEXT NOT NULL,
  c TEXT
);
'''
q3 = "INSERT INTO test VALUES ( 1, 'this', 'that' );"

sh.perform_insert_and_stats(q1, 'test.db')
sh.perform_insert_and_stats(q2, 'test.db')
sh.perform_insert_and_stats(q3, 'test.db')

### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| DROP TABLE test; |||
### Query Summary ###

DATABASE QUERIED: test.db
QUERY: |||
CREATE TABLE test (
  a INTEGER NOT NULL,
  b TEXT NOT NULL,
  c TEXT
);
 |||
### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| INSERT INTO test VALUES ( 1, 'this', 'that' ); |||

In [42]:
# see what we have
q = "SELECT * FROM test;"
sh.query_result_stats(q, "test.db")

### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| SELECT * FROM test; |||

There are 1 rows in the query results table
There are 3 columns in the query results table

First 5 rows of the query results:
   a     b     c
0  1  this  that

In [39]:
# add some more data

q1 = " INSERT INTO test ( b, c ) VALUES ( 'one', 'two' );"
q2 = "INSERT INTO test ( a, c ) VALUES ( 1, 'two' );"
q3 = "INSERT INTO test ( a, b ) VALUES ( 1, 'two' );"

sh.perform_insert_and_stats(q1, 'test.db')
sh.perform_insert_and_stats(q2, 'test.db')
sh.perform_insert_and_stats(q3, 'test.db')

IntegrityError: NOT NULL constraint failed: test.a

In [2]:
# clean up the data
q = "DROP TABLE test;"
sh.perform_insert_and_stats(q, 'test.db')

### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| DROP TABLE test; |||

# Constraining Columns

In [3]:

q1 = "DROP TABLE IF EXISTS test;"
q2 = "CREATE TABLE test ( a TEXT, b TEXT, c TEXT );"
q3 = "INSERT INTO test ( a, b ) VALUES ( 'one', 'two' );"

sh.perform_insert_and_stats(q1, 'chapter03.db')
sh.perform_insert_and_stats(q2, 'chapter03.db')
sh.perform_insert_and_stats(q3, 'chapter03.db')

### Query Summary ###

DATABASE QUERIED: chapter03.db
QUERY: ||| DROP TABLE IF EXISTS test; |||
### Query Summary ###

DATABASE QUERIED: chapter03.db
QUERY: ||| CREATE TABLE test ( a TEXT, b TEXT, c TEXT ); |||
### Query Summary ###

DATABASE QUERIED: chapter03.db
QUERY: ||| INSERT INTO test ( a, b ) VALUES ( 'one', 'two' ); |||

In [4]:
# see what we have
q = "SELECT * FROM test;"
sh.query_result_stats(q, "chapter03.db")

### Query Summary ###

DATABASE QUERIED: chapter03.db
QUERY: ||| SELECT * FROM test; |||

There are 1 rows in the query results table
There are 3 columns in the query results table

First 5 rows of the query results:
     a    b     c
0  one  two  None

# Changing a schema

In [5]:

q1 = "DROP TABLE IF EXISTS test;"
q2 = "CREATE TABLE test ( a TEXT, b TEXT, c TEXT );"
q3 = "INSERT INTO test VALUES ( 'one', 'two', 'three');"
q4 = "INSERT INTO test VALUES ( 'two', 'three', 'four');"
q5 = "INSERT INTO test VALUES ( 'three', 'four', 'five');"

sh.perform_insert_and_stats(q1, 'chapter03.db')
sh.perform_insert_and_stats(q2, 'chapter03.db')
sh.perform_insert_and_stats(q3, 'chapter03.db')
sh.perform_insert_and_stats(q4, 'chapter03.db')
sh.perform_insert_and_stats(q5, 'chapter03.db')

### Query Summary ###

DATABASE QUERIED: chapter03.db
QUERY: ||| DROP TABLE IF EXISTS test; |||
### Query Summary ###

DATABASE QUERIED: chapter03.db
QUERY: ||| CREATE TABLE test ( a TEXT, b TEXT, c TEXT ); |||
### Query Summary ###

DATABASE QUERIED: chapter03.db
QUERY: ||| INSERT INTO test VALUES ( 'one', 'two', 'three'); |||
### Query Summary ###

DATABASE QUERIED: chapter03.db
QUERY: ||| INSERT INTO test VALUES ( 'two', 'three', 'four'); |||
### Query Summary ###

DATABASE QUERIED: chapter03.db
QUERY: ||| INSERT INTO test VALUES ( 'three', 'four', 'five'); |||

In [6]:
# see what we have
q = "SELECT * FROM test;"
sh.query_result_stats(q, "chapter03.db")

### Query Summary ###

DATABASE QUERIED: chapter03.db
QUERY: ||| SELECT * FROM test; |||

There are 3 rows in the query results table
There are 3 columns in the query results table

First 5 rows of the query results:
       a      b      c
0    one    two  three
1    two  three   four
2  three   four   five

In [7]:
# modify the table

q1 = "ALTER TABLE test ADD d TEXT;"
q2 = "ALTER TABLE test ADD e TEXT DEFAULT 'panda';"

sh.perform_insert_and_stats(q1, 'chapter03.db')
sh.perform_insert_and_stats(q2, 'chapter03.db')

### Query Summary ###

DATABASE QUERIED: chapter03.db
QUERY: ||| ALTER TABLE test ADD d TEXT; |||
### Query Summary ###

DATABASE QUERIED: chapter03.db
QUERY: ||| ALTER TABLE test ADD e TEXT DEFAULT 'panda'; |||

In [8]:
# see what we have
q = "SELECT * FROM test;"
sh.query_result_stats(q, "chapter03.db")

### Query Summary ###

DATABASE QUERIED: chapter03.db
QUERY: ||| SELECT * FROM test; |||

There are 3 rows in the query results table
There are 5 columns in the query results table

First 5 rows of the query results:
       a      b      c     d      e
0    one    two  three  None  panda
1    two  three   four  None  panda
2  three   four   five  None  panda

# ID columns

In [9]:
# 
q1 = "DROP TABLE IF EXISTS test;"
q2 = '''
CREATE TABLE test (
  id INTEGER PRIMARY KEY,
  a INTEGER,
  b TEXT
);
'''
q3 = "INSERT INTO test (a, b) VALUES ( 10, 'a' );"
q4 = "INSERT INTO test (a, b) VALUES ( 11, 'b' );"
q5 = "INSERT INTO test (a, b) VALUES ( 12, 'c' );"

sh.perform_insert_and_stats(q1, 'chapter03.db')
sh.perform_insert_and_stats(q2, 'chapter03.db')
sh.perform_insert_and_stats(q3, 'chapter03.db')
sh.perform_insert_and_stats(q4, 'chapter03.db')
sh.perform_insert_and_stats(q5, 'chapter03.db')

### Query Summary ###

DATABASE QUERIED: chapter03.db
QUERY: ||| DROP TABLE IF EXISTS test; |||
### Query Summary ###

DATABASE QUERIED: chapter03.db
QUERY: |||
CREATE TABLE test (
  id INTEGER PRIMARY KEY,
  a INTEGER,
  b TEXT
);
 |||
### Query Summary ###

DATABASE QUERIED: chapter03.db
QUERY: ||| INSERT INTO test (a, b) VALUES ( 10, 'a' ); |||
### Query Summary ###

DATABASE QUERIED: chapter03.db
QUERY: ||| INSERT INTO test (a, b) VALUES ( 11, 'b' ); |||
### Query Summary ###

DATABASE QUERIED: chapter03.db
QUERY: ||| INSERT INTO test (a, b) VALUES ( 12, 'c' ); |||

In [10]:
# see what we have
q = "SELECT * FROM test;"
sh.query_result_stats(q, "chapter03.db")

### Query Summary ###

DATABASE QUERIED: chapter03.db
QUERY: ||| SELECT * FROM test; |||

There are 3 rows in the query results table
There are 3 columns in the query results table

First 5 rows of the query results:
   id   a  b
0   1  10  a
1   2  11  b
2   3  12  c

# Filtering data

In [11]:
#
q = "SELECT Name, Continent, Population FROM Country WHERE Population < 100000 ORDER BY Population DESC;"
sh.query_result_stats(q, "world.db")

### Query Summary ###

DATABASE QUERIED: world.db
QUERY: ||| SELECT Name, Continent, Population FROM Country WHERE Population < 100000 ORDER BY Population DESC; |||

There are 40 rows in the query results table
There are 3 columns in the query results table

First 5 rows of the query results:
                   Name      Continent  Population
0                 Tonga        Oceania       99000
1               Grenada  North America       94000
2  Virgin Islands, U.S.  North America       93000
3              Kiribati        Oceania       83000
4               Andorra         Europe       78000

In [13]:
# include NULL Populations
q = """
SELECT Name, Continent, Population 
FROM Country 
WHERE Population < 100000 OR Population IS NULL 
ORDER BY Population DESC;"""
sh.query_result_stats(q, "world.db")

### Query Summary ###

DATABASE QUERIED: world.db
QUERY: |||
SELECT Name, Continent, Population
FROM Country
WHERE Population < 100000 OR Population IS NULL
ORDER BY Population DESC; |||

There are 47 rows in the query results table
There are 3 columns in the query results table

First 5 rows of the query results:
                   Name      Continent  Population
0                 Tonga        Oceania     99000.0
1               Grenada  North America     94000.0
2  Virgin Islands, U.S.  North America     93000.0
3              Kiribati        Oceania     83000.0
4               Andorra         Europe     78000.0

In [14]:
# using AND
q = """SELECT Name, Continent, Population 
FROM Country 
WHERE Population < 100000 AND Continent = 'Oceania' 
ORDER BY Population DESC;"""
sh.query_result_stats(q, "world.db")

### Query Summary ###

DATABASE QUERIED: world.db
QUERY: ||| SELECT Name, Continent, Population
FROM Country
WHERE Population < 100000 AND Continent = 'Oceania'
ORDER BY Population DESC; |||

There are 16 rows in the query results table
There are 3 columns in the query results table

First 5 rows of the query results:
                       Name Continent  Population
0                     Tonga   Oceania       99000
1                  Kiribati   Oceania       83000
2  Northern Mariana Islands   Oceania       78000
3            American Samoa   Oceania       68000
4          Marshall Islands   Oceania       64000

In [15]:
# using the like string matching
q = "SELECT Name, Continent, Population FROM Country WHERE Name LIKE '%island%' ORDER BY Name;"
sh.query_result_stats(q, "world.db")

### Query Summary ###

DATABASE QUERIED: world.db
QUERY: ||| SELECT Name, Continent, Population FROM Country WHERE Name LIKE '%island%' ORDER BY Name; |||

There are 18 rows in the query results table
There are 3 columns in the query results table

First 5 rows of the query results:
                      Name      Continent  Population
0            Bouvet Island     Antarctica         NaN
1           Cayman Islands  North America     38000.0
2         Christmas Island        Oceania      2500.0
3  Cocos (Keeling) Islands        Oceania       600.0
4             Cook Islands        Oceania     20000.0

In [16]:
# using the in operator
q = "SELECT Name, Continent, Population FROM Country WHERE Continent IN ( 'Europe', 'Asia' ) ORDER BY Name;"
sh.query_result_stats(q, "world.db")

### Query Summary ###

DATABASE QUERIED: world.db
QUERY: ||| SELECT Name, Continent, Population FROM Country WHERE Continent IN ( 'Europe', 'Asia' ) ORDER BY Name; |||

There are 97 rows in the query results table
There are 3 columns in the query results table

First 5 rows of the query results:
          Name Continent  Population
0  Afghanistan      Asia    22720000
1      Albania    Europe     3401200
2      Andorra    Europe       78000
3      Armenia      Asia     3520000
4      Austria    Europe     8091800

# Removing duplicates

In [17]:
# getting continents
q = "SELECT Continent FROM Country;"
sh.query_result_stats(q, "world.db")

### Query Summary ###

DATABASE QUERIED: world.db
QUERY: ||| SELECT Continent FROM Country; |||

There are 239 rows in the query results table
There are 1 columns in the query results table

First 5 rows of the query results:
       Continent
0           Asia
1         Europe
2  North America
3         Europe
4         Africa

In [18]:
# getting distinct continents
q = "SELECT DISTINCT Continent FROM Country;"
sh.query_result_stats(q, "world.db")

### Query Summary ###

DATABASE QUERIED: world.db
QUERY: ||| SELECT DISTINCT Continent FROM Country; |||

There are 7 rows in the query results table
There are 1 columns in the query results table

First 5 rows of the query results:
       Continent
0           Asia
1         Europe
2  North America
3         Africa
4        Oceania

# Ordering output

In [19]:
# 
q = "SELECT Name FROM Country ORDER BY Name;"
sh.query_result_stats(q, "world.db")

### Query Summary ###

DATABASE QUERIED: world.db
QUERY: ||| SELECT Name FROM Country ORDER BY Name; |||

There are 239 rows in the query results table
There are 1 columns in the query results table

First 5 rows of the query results:
             Name
0     Afghanistan
1         Albania
2         Algeria
3  American Samoa
4         Andorra

In [20]:
# sort descending
q = "SELECT Name FROM Country ORDER BY Name DESC;"
sh.query_result_stats(q, "world.db")

### Query Summary ###

DATABASE QUERIED: world.db
QUERY: ||| SELECT Name FROM Country ORDER BY Name DESC; |||

There are 239 rows in the query results table
There are 1 columns in the query results table

First 5 rows of the query results:
             Name
0        Zimbabwe
1          Zambia
2      Yugoslavia
3           Yemen
4  Western Sahara

In [21]:
# sorting on multiple columns
q = "SELECT Name, Continent FROM Country ORDER BY Continent, Name;"
sh.query_result_stats(q, "world.db")

### Query Summary ###

DATABASE QUERIED: world.db
QUERY: ||| SELECT Name, Continent FROM Country ORDER BY Continent, Name; |||

There are 239 rows in the query results table
There are 2 columns in the query results table

First 5 rows of the query results:
                             Name Continent
0                         Algeria    Africa
1                          Angola    Africa
2                           Benin    Africa
3                        Botswana    Africa
4  British Indian Ocean Territory    Africa

In [22]:
# have Continent be in descending order with the other columns in ascending order
q = "SELECT Name, Continent, Region FROM Country ORDER BY Continent DESC, Region, Name;"
sh.query_result_stats(q, "world.db")

### Query Summary ###

DATABASE QUERIED: world.db
QUERY: ||| SELECT Name, Continent, Region FROM Country ORDER BY Continent DESC, Region, Name; |||

There are 239 rows in the query results table
There are 3 columns in the query results table

First 5 rows of the query results:
        Name      Continent         Region
0  Argentina  South America  South America
1    Bolivia  South America  South America
2     Brazil  South America  South America
3      Chile  South America  South America
4   Colombia  South America  South America

# Conditional Expressions

In [25]:
# 
q1 = "CREATE TABLE booltest (a INTEGER, b INTEGER);"
q2 = "INSERT INTO booltest VALUES (1, 0);"

sh.perform_insert_and_stats(q1, 'test.db')
sh.perform_insert_and_stats(q2, 'test.db')

### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| CREATE TABLE booltest (a INTEGER, b INTEGER); |||
### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| INSERT INTO booltest VALUES (1, 0); |||

In [26]:
# what do we have
q = "SELECT * FROM booltest;"
sh.query_result_stats(q, "test.db")

### Query Summary ###

DATABASE QUERIED: test.db
QUERY: ||| SELECT * FROM booltest; |||

There are 1 rows in the query results table
There are 2 columns in the query results table

First 5 rows of the query results:
   a  b
0  1  0

In [27]:
q = """
SELECT
    CASE WHEN a THEN 'true' ELSE 'false' END as boolA,
    CASE WHEN b THEN 'true' ELSE 'false' END as boolB
    FROM booltest
;
"""
sh.query_result_stats(q, "test.db")

### Query Summary ###

DATABASE QUERIED: test.db
QUERY: |||
SELECT
    CASE WHEN a THEN 'true' ELSE 'false' END as boolA,
    CASE WHEN b THEN 'true' ELSE 'false' END as boolB
    FROM booltest
;
 |||

There are 1 rows in the query results table
There are 2 columns in the query results table

First 5 rows of the query results:
  boolA  boolB
0  true  false

In [28]:
q = """
SELECT
  CASE a WHEN 1 THEN 'true' ELSE 'false' END AS boolA,
  CASE b WHEN 1 THEN 'true' ELSE 'false' END AS boolB 
  FROM booltest
;
"""
sh.query_result_stats(q, "test.db")

### Query Summary ###

DATABASE QUERIED: test.db
QUERY: |||
SELECT
  CASE a WHEN 1 THEN 'true' ELSE 'false' END AS boolA,
  CASE b WHEN 1 THEN 'true' ELSE 'false' END AS boolB
  FROM booltest
;
 |||

There are 1 rows in the query results table
There are 2 columns in the query results table

First 5 rows of the query results:
  boolA  boolB
0  true  false